window.noname_update = {
	version: "1.10.11.3",
	update: "NULL", //新版本更新文件较多，直接强制进行全量更新
	changeLog: [
		"跟进v1.10.15.1的更新内容（by 棘手怀念摧毁），已跟进#1989前的Pull requests",
		// "即将跟进：#1989/#1994/#2004/#2008/#2009/#2011/#2015/#2016/#2019/#2029/#2031/#2032/#2033/#2037/#2038/#2039/#2040/#2041/#2042/#2043/#2045/#2046...",
		// "计划提前跟进：神黄月英、曲阿小将、#2210/#2234/#2350?",
		// "提前跟进中：#3032、OL·魔、兵势篇、蚀心入魔、四象封印（#2405等）",
		// "已提前跟进：",
		// "#2160/#2170/#2179/#2203/#2325/#2345/#2410/#2478/#2531/#2542/#2588/#2792/#2817/#2831/#2832/#2834/#2871/#2894/#2926/#2934/#2966/#3108",
		// "十二生肖",
		// "表情包更新",
		
		// 备忘：
		// roundEnd时机待适配
		// hasCard(true, "h")待适配
		
		// onlyOL
		// 魔孙权dm_sunquan、魔吕布dm_lvbu、魔司马懿dm_simayi暂不可用
		// bingshi
		// get.addNewRowList、player.chooseButtonTarget待适配（势陈祗mb_chenzhi、势国渊guoyuan、势陆郁生mb_luyusheng暂不可用）
		// sxrm
		// 疑蒋干sxrmzongheng待修复
		// 加魔势力？还是先临时修改为神势力吧（by 棘手怀念摧毁）
		
	],
	files: [],
};
